# Learning Pandas

## Pandas Series
---
- A Series is a one-Dimensional labeled array capable of holding any data type.The axis are collectively called the index.

### Creating Series
- There are multiple ways to create a pandas series

In [9]:
import pandas as pd
import numpy as np
labels = ["A","B","C","D","E"]

lst = [10,20,30,40,50]
arr = np.array(lst)
dic = {
    "A" : 10,
    "B" : 20,
    "C" : 30,
    "D" : 40,
    "E" : 50
}


data1 = pd.Series(lst,index=labels)
data2 = pd.Series(arr,index=labels)
data3 = pd.Series(dic)
print(data1,"\n",data2,"\n",data3)

A    10
B    20
C    30
D    40
E    50
dtype: int64
 A    10
B    20
C    30
D    40
E    50
dtype: int64
 A    10
B    20
C    30
D    40
E    50
dtype: int64

## Dataframe
---
- When to combine mutliple series into one table then dataframe is created.

In [13]:
import numpy as np
import pandas as pd

# list/array/dict

data = {
    "Name": ["John","Anna","Peter","Linda"],
    "Age" : [26,43,56,23],
    "City" : ["Delhi","Noida","Kanpur","Agra"],
    "Salary" : [65000,56000,34000,66000]
}

# values are header
# values are data 

df = pd.DataFrame(data)
print(df)

    Name  Age    City  Salary
0   John   26   Delhi   65000
1   Anna   43   Noida   56000
2  Peter   56  Kanpur   34000
3  Linda   23    Agra   66000

In [41]:
# Using List to create dataframe
colm = ["Name","Age","City","Salary"]
data_list = [
    ["John",36,"Delhi",56000],
    ["Anna",34,"Noida",45000],
    ["Peter",20,"Kanpur",78000],
    ["Linda",65,"Agra",67000]
]

df = pd.DataFrame(data_list,columns=colm)
df

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

### Selection and Indexing of Columns
---

In [34]:
for name,value in df.items():
    print(name,"\n",value)

Name
 0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object
Age
 0    36
1    34
2    20
3    65
Name: Age, dtype: int64
City
 0     Delhi
1     Noida
2    Kanpur
3      Agra
Name: City, dtype: object
Salary
 0    56000
1    45000
2    78000
3    67000
Name: Salary, dtype: int64

In [40]:
df[["Name","City"]]

    Name    City
0   John   Delhi
1   Anna   Noida
2  Peter  Kanpur
3  Linda    Agra

### Append New Column into DF
---

In [58]:
df["Designation"] = ["Dr.","Eng.","ME","EE"]
df

    Name  Age    City  Salary Designation
0   John   36   Delhi   56000         Dr.
1   Anna   34   Noida   45000        Eng.
2  Peter   20  Kanpur   78000          ME
3  Linda   65    Agra   67000          EE

### Remove Column from Dataframe
---

In [ ]:
df.drop("Designation",axis=1)  ## It delete the Column Temp.

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

In [ ]:
df.drop("Designation",axis=1,inplace=True)  ## Delete the Column Permanet
## To delete a row "axis = 0"
df

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

### Selecting Row
---

In [69]:
df["Age"][0]

np.int64(36)

### Selecting Subset of Rows and Column
---

In [79]:
df.loc[2:][["Name","Age"]]

    Name  Age
2  Peter   20
3  Linda   65

### Conditional Selection
---

In [86]:
## Show People those age is 30 and more
df[df["Age"] >= 30]

    Name  Age   City  Salary
0   John   36  Delhi   56000
1   Anna   34  Noida   45000
3  Linda   65   Agra   67000

In [92]:
## Show People age is greater then 30 and city is Noida
df[(df["Age"] > 30) & (df["City"] == "Noida")]

   Name  Age   City  Salary
1  Anna   34  Noida   45000